{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Лабораторная работа 3"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Описание задания\n",
    "\n",
    "Предположим, у вас есть шоколадная плитка размером n × m, где n и m — целые числа (например, 3 × 5). Ваша цель — разломать шоколадку на отдельные квадратики размером 1 × 1. Вы можете ломать шоколадку только прямыми линиями вдоль линий сетки (параллельно сторонам).\n",
    "\n",
    "### Задание\n",
    "Написать программу на Python, которая определит минимальное количество разломов, необходимых для разбивания шоколадки на отдельные квадратики 1 х 1. \n",
    "\n",
    "### Пример\n",
    "Для шоколадки размером 2 × 2 минимальное количество разломов равно 3 (либо 2 горизонтальных и 1 вертикальный, либо 2 вертикальных и 1 горизонтальный).\n",
    "\n",
    "### Подсказки\n",
    "\n",
    "1. Если n == 1 и m == 1, то разломов не требуется, поскольку уже имеем квадратик 1 × 1.\n",
    "2. Если одна из сторон равна 1, то количество разломов равно длине другой стороны минус один (так как каждый разлом уменьшает одну сторону до единицы).\n",
    "3. В общем случае вы должны выбрать, где разломать пополам: либо по вертикали, либо по горизонтали — и использовать рекурсию для обеих частей.\n",
    " \n",
    "**Дополнительное задание** (необязательное для выполнения): оптимизировать функцию, используя мемоизацию (кеширование результатов промежуточных вычислений) для уменьшения количества вызовов функции.\n",
    "\n",
    "Выполненное задание разместите на GitHub или аналогах."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "from typing import Tuple, Any, Hashable"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "def memoize(func: callable) -> callable:\n",
    "    cache = {} # Это хранилище результатов\n",
    "    def wrapper(size: Tuple[int]) -> int:\n",
    "        if size not in cache:\n",
    "            cache[size] = func(size)\n",
    "        return cache[size]\n",
    "    return wrapper\n",
    "\n",
    "\n",
    "@memoize\n",
    "def solution(size: Tuple[int]) -> int:\n",
    "    a, b = min(size), max(size)\n",
    "\n",
    "    if b == 1:\n",
    "        return 0\n",
    "    elif b == 2 and a == 1:\n",
    "        return 1\n",
    "    else:\n",
    "        return 1 + solution((a, b // 2)) + solution((a, b - b//2)) \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Тестовые данные: {'size': (1, 1)}\n",
      "Ожидаемый результат: 0\n",
      "Результат теста: True\n",
      "\n",
      "Тестовые данные: {'size': (2, 1)}\n",
      "Ожидаемый результат: 1\n",
      "Результат теста: True\n",
      "\n",
      "Тестовые данные: {'size': (1, 2)}\n",
      "Ожидаемый результат: 1\n",
      "Результат теста: True\n",
      "\n",
      "Тестовые данные: {'size': (1, 3)}\n",
      "Ожидаемый результат: 2\n",
      "Результат теста: True\n",
      "\n",
      "Тестовые данные: {'size': (3, 1)}\n",
      "Ожидаемый результат: 2\n",
      "Результат теста: True\n",
      "\n",
      "Тестовые данные: {'size': (2, 2)}\n",
      "Ожидаемый результат: 3\n",
      "Результат теста: True\n",
      "\n",
      "Тестовые данные: {'size': (2, 3)}\n",
      "Ожидаемый результат: 5\n",
      "Результат теста: True\n",
      "\n",
      "Тестовые данные: {'size': (3, 2)}\n",
      "Ожидаемый результат: 5\n",
      "Результат теста: True\n",
      "\n",
      "Тестовые данные: {'size': (3, 3)}\n",
      "Ожидаемый результат: 8\n",
      "Результат теста: True\n",
      "\n"
     ]
    }
   ],
   "source": [
    "testing_function = solution\n",
    "\n",
    "test_cases = [\n",
    "    ({'size': (1,1)}, 0),\n",
    "    ({'size': (2,1)}, 1),\n",
    "    ({'size': (1,2)}, 1),\n",
    "    ({'size': (1,3)}, 2),\n",
    "    ({'size': (3,1)}, 2),\n",
    "    ({'size': (2,2)}, 3),\n",
    "    ({'size': (2,3)}, 5),\n",
    "    ({'size': (3,2)}, 5),\n",
    "    ({'size': (3,3)}, 8)\n",
    "]\n",
    "\n",
    "\n",
    "for test_data, expected_result in test_cases:\n",
    "    print(\n",
    "        f'Тестовые данные: {test_data}',\n",
    "        f'Ожидаемый результат: {expected_result}',\n",
    "        f'Результат теста: {testing_function(**test_data) == expected_result}',\n",
    "        sep='\\n', end='\\n\\n'\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "env_full",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
